Revit 2026 API

# RenderingSettingsResolutionTarget Property

---

The resolution target.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ResolutionTarget ResolutionTarget { get; set; }
```
```vb
Public Property ResolutionTarget As ResolutionTarget
	Get
	Set
```
```cpp
public:
property ResolutionTarget ResolutionTarget {
	ResolutionTarget get ();
	void set (ResolutionTarget value);
}
```
```fsharp
member ResolutionTarget : ResolutionTarget with get, set
```

#### Property Value

ResolutionTarget

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

RenderingSettings Class

Autodesk.Revit.DB Namespace